tap "nikitabobko/tap"

# Core Utils
brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "grep"
brew "gawk"
brew "make"
brew "bash"
brew "wget"
brew "watch"

# Utils
brew "tldr"
brew "neovim"
brew "gh"
brew "fzf"
brew "ripgrep"
brew "age"
brew "btop"
brew "ffmpeg"
brew "xclip"
brew "php"
brew "composer"
brew "node"
brew "pnpm"
brew "go"
brew "caddy"
brew "zellij"
brew "lazydocker"
brew "lazygit"
brew "scc"

# Casks
cask "aerospace"
cask "claude-code"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "firefox@developer-edition"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "postman"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
cask "warp"
